#include <stdio.h>
/*打印主界面*/
void printMainPage(){
    printf("==================================\n");
    printf("请选择你的身份:\n");
    printf("1.管理员\n");
    printf("2.教师\n");
    printf("3.学生\n");
    printf("==================================\n");
}
/*管理员登陆界面*/
void printAdminPage(){
    printf("==================================\n");
    printf("1. 修改自身登录密码\n");
    printf("2. 添加新教师\n");
    printf("3. 查看所有教师\n");
    printf("4. 删除教师\n");
    printf("5. 修改教师信息\n");
    printf("==================================\n");
}
/*打印教师登陆界面*/
void printTeacherPage(){
    printf("==================================\n");
    printf("1. 修改自身登录密码\n");
    printf("2. 查阅自身信息\n");
    printf("3. 添加新学生\n");
    printf("4. 删除学生\n");
    printf("5. 查阅指定学生信息\n");
    printf("6. 修改学生信息（姓名、性别、出生日期、三门功课成绩）\n");
    printf("7. 按学号从低到高查看所有学生信息\n");
    printf("8. 按总分从高到低查看所有学生信息\n");
    printf("==================================\n");
}
/*打印学生登陆界面*/
void printStudentPage(){
    printf("==================================\n");
    printf("1. 修改自身登录密码\n");
    printf("2. 查阅自身信息\n");
    printf("==================================\n");
}